custom/version-control-settings.org
* Version Control

  [[https://github.com/RyanDur/Ruth-Teitelbaum-emacs-config][Back to main config]]

** Magit

   Use git for  version control
   #+BEGIN_SRC emacs-lisp
   (use-package magit
     :ensure t)
   #+END_SRC

   Setup auto commit on save for a given hook
   #+BEGIN_SRC emacs-lisp
   (use-package git-auto-commit-mode
     :ensure t)
   #+END_SRC

   Create links to pages in Git-hub
   #+BEGIN_SRC emacs-lisp
   (use-package git-link
     :ensure t
     :config (global-set-key (kbd "C-c g l") 'git-link))
   #+END_SRC

   I would like to see the older versions of a file
   #+BEGIN_SRC emacs-lisp
   (use-package git-timemachine
     :ensure t)
   #+END_SRC

   I would like to see the last commit for a line in a pop-up
   #+BEGIN_SRC emacs-lisp
   (use-package git-messenger
     :ensure t
     :config
     (global-set-key (kbd "C-x v p") 'git-messenger:popup-message)
     (define-key git-messenger-map (kbd "m") 'git-messenger:copy-message)

     ;; Use magit-show-commit for showing status/diff commands
     (custom-set-variables '(git-messenger:use-magit-popup t)))
   #+END_SRC
